------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\LENOVO\Documents\YOUNG RESEARCHERS FELLOWSHIP\PAPER YRF\log_resultados.log
  log type:  text
 opened on:  30 Mar 2025, 16:30:43

. 
. //Cargar base de datos
. use "C:\Users\LENOVO\Documents\YOUNG RESEARCHERS FELLOWSHIP\PAPER YRF\BDD_ENSANUT_2018_STATA_2\1_BDD_ENS2018_f1_personas.dta"

. merge 1:1 id_per using "C:\Users\LENOVO\Documents\YOUNG RESEARCHERS FELLOWSHIP\PAPER YRF\BDD_ENSANUT_2018_STATA_2\4_BDD_ENS2018_f2
> _mef.dta"
(label area already defined)
(label nivins already defined)
(label gedad_anios already defined)
(label region already defined)
(label etnia already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       120,047
        from master                   120,047  (_merge==1)
        from using                          0  (_merge==2)

    Matched                            48,700  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |    120,047       71.14       71.14
            Matched (3) |     48,700       28.86      100.00
------------------------+-----------------------------------
                  Total |    168,747      100.00

. lookfor sex

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------------
sexo            byte    %8.0g      f1_s2_2    Sexo
f2_s8_800d      byte    %8.0g      f2_s8_800d
                                              800.d Las relaciones sexuales - ¿Recibió o ha recibido información sobre:
f2_s8_801d      byte    %8.0g      f2_s8_801d
                                              801.d Las relaciones sexuales - ¿De quién o dónde recibió la mayor información
f2_s8_800g      byte    %8.0g      f2_s8_800g
                                              800.g Las infecciones de transmisión sexual o VIH/SIDA - ¿Recibió o ha recibido
f2_s8_801g      byte    %8.0g      f2_s8_801g
                                              801.g Las infecciones de transmisión sexual o VIH/SIDA - ¿De quién o dónde rec
f2_s8_800i      byte    %8.0g      f2_s8_800i
                                              800.i Sexualidad - ¿Recibió o ha recibido información sobre:
f2_s8_801i      byte    %8.0g      f2_s8_801i
                                              801.i Sexualidad - ¿De quién o dónde recibió la mayor información?
f2_s8_803       byte    %8.0g      f2_s8_803
                                              803.  ¿Ha tenido relaciones sexuales?
f2_s8_804       byte    %8.0g                 804.  ¿Cuántos años cumplidos tenía usted cuando tuvo su primera relación sexual
f2_s8_805       byte    %8.0g                 805.  ¿Qué edad tenía la persona con quién tuvo la primera relación sexual? (coi
f2_s8_807       byte    %8.0g      f2_s8_807
                                              807.  ¿Su primera relación sexual ocurrió porque:
f2_s8_810       byte    %8.0g      f2_s8_810
                                              810.  ¿Quién decidió usar el método en la primera relación sexual?
f2_s8_831       byte    %8.0g                 831.  ¿Cuántos años cumplidos tenía usted cuando tuvo su primera relación sexual
f2_s8_832_dias  byte    %8.0g                 832.  ¿Hace cuánto tiempo tuvo su última relación sexual (coito)? días
f2_s8_832_sem~s byte    %8.0g                 832.  ¿Hace cuánto tiempo tuvo su última relación sexual (coito)?: semanas
f2_s8_832_meses byte    %8.0g                 832.  ¿Hace cuánto tiempo tuvo su última relación sexual (coito)?: meses
f2_s8_832_anios byte    %8.0g                 832.  ¿Hace cuánto tiempo tuvo su última relación sexual (coito)?: años
f2_s8_834       byte    %8.0g      f2_s8_834
                                              834.  ¿Usó el condón en su última relación sexual?
f2_s8_838_3     byte    %8.0g      f2_s8_838_3
                                              838.3 ¿Evitar otras infecciones de transmisión sexual?
f2_s8_839       byte    %8.0g      f2_s8_839
                                              839.  Cuándo usted no desea tener relaciones sexuales ¿puede decírselo a su espo
f2_s10_1000     byte    %8.0g      f2_s10_1000
                                              1000.  ¿Ha oído hablar de las infecciones de transmisión sexual?
f2_s10_1001_1   byte    %8.0g                 1001.a ¿Cuáles infecciones de transmisión sexual ha oído hablar?  Sifilis?
f2_s10_1001_2   byte    %8.0g                 1001.b ¿Cuáles infecciones de transmisión sexual ha oído hablar?  Gonorrea?
f2_s10_1001_3   byte    %8.0g                 1001.c ¿Cuáles infecciones de transmisión sexual ha oído hablar?  VIH / Sida?
f2_s10_1001_4   byte    %8.0g                 1001.d ¿Cuáles infecciones de transmisión sexual ha oído hablar?  Herpes genita
f2_s10_1001_5   byte    %8.0g                 1001.e ¿Cuáles infecciones de transmisión sexual ha oído hablar?  Virus de Papi
f2_s10_1001_6   byte    %8.0g                 1001.f ¿Cuáles infecciones de transmisión sexual ha oído hablar?  Chancro?
f2_s10_1001_7   byte    %8.0g                 1001.g ¿Cuáles infecciones de transmisión sexual ha oído hablar? Clamidia?
f2_s10_1001_8   byte    %8.0g                 1001.h ¿Cuáles infecciones de transmisión sexual ha oído hablar? Hepatitis B?
f2_s10_1001_9   byte    %8.0g                 1001.h ¿Cuáles infecciones de transmisión sexual ha oído hablar? Tricomoniasis?
f2_s10_1001_10  byte    %8.0g                 1001.j ¿Cuáles infecciones de transmisión sexual ha oído hablar? Candidiasis?
f2_s10_1009_2   byte    %8.0g                 1009.b Manteniendo relaciones sexuales únicamente con una pareja que no tiene o
f2_s10_1009_3   byte    %8.0g                 1009.c Utilizando un preservativo cada vez que tiene relaciones sexuales?
f2_s10_1009_4   byte    %8.0g                 1009.d No tener relaciones sexuales con desconocidos?
f2_s10_1013     byte    %8.0g      f2_s10_1013
                                              1013.  ¿En los últimos 12 meses en su última relación sexual utilizó condón?

. 
. //LIMPIEZA DE DATOS
. //Conservar solo mujeres
. keep if sexo == 2
(82,403 observations deleted)

. 
. //Conservar solo datos correctos
. keep if _merge == 3
(37,644 observations deleted)

. drop _merge

. 
. //Guardar la nueva base de datos
. save "C:\Users\LENOVO\Documents\YOUNG RESEARCHERS FELLOWSHIP\PAPER YRF\ENSANUT_Merge_Final.dta", replace
file C:\Users\LENOVO\Documents\YOUNG RESEARCHERS FELLOWSHIP\PAPER YRF\ENSANUT_Merge_Final.dta saved

. 
. //Definición de variables clave
. //1. Definición de discapacidad
. capture drop discapacidad_nueva

. gen discapacidad_nueva = 0  // Primero, asumimos que NADIE tiene discapacidad

. 
. // Si tiene carné de discapacidad (dato oficial)
. replace discapacidad_nueva = 1 if f1_s2_11 == 1  
(423 real changes made)

. 
. // Si tiene al menos "algo de dificultad" (2, 3 o 4) en cualquier pregunta de discapacidad
. replace discapacidad_nueva = 1 if f1_s2_10_1 >= 2 & f1_s2_10_1 <= 4
(3,460 real changes made)

. replace discapacidad_nueva = 1 if f1_s2_10_2 >= 2 & f1_s2_10_2 <= 4
(298 real changes made)

. replace discapacidad_nueva = 1 if f1_s2_10_3 >= 2 & f1_s2_10_3 <= 4
(357 real changes made)

. replace discapacidad_nueva = 1 if f1_s2_10_4 >= 2 & f1_s2_10_4 <= 4
(507 real changes made)

. replace discapacidad_nueva = 1 if f1_s2_10_5 >= 2 & f1_s2_10_5 <= 4
(33 real changes made)

. replace discapacidad_nueva = 1 if f1_s2_10_6 >= 2 & f1_s2_10_6 <= 4
(80 real changes made)

. 
. //Verificación de los resultados
. tab discapacidad_nueva

discapacida |
    d_nueva |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,542       89.41       89.41
          1 |      5,158       10.59      100.00
------------+-----------------------------------
      Total |     48,700      100.00

. count if discapacidad_nueva == 0
  43,542

. count if discapacidad_nueva == 1
  5,158

. 
. //2. Definición de conocimiento de SSR
. gen conocimiento_ssr = 0  // Inicializamos con 0 para todos

. 
. // Convertir respuestas de "sí" en conocimiento (1)
. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s5_518 == 1
(12,059 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s5_519 == 1
(8,960 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s8_800f == 1
(39,562 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s10_1002_3 == 1
(8,633 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s10_1014 == 1
(35,953 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s10_1016 == 1
(25,887 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s2_201 == 1 | f2_s2_201 == 2 | f2_s2_201 == 3  // Todas cuentan como experie
> ncia
(1,464 real changes made)

. replace conocimiento_ssr = conocimiento_ssr + 1 if f2_s8_800e == 1
(40,501 real changes made)

. 
. sum conocimiento_ssr

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
conocimien~r |     48,700    3.552752    1.743904          0          8

. tab conocimiento_ssr

conocimient |
      o_ssr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,162        6.49        6.49
          1 |      2,952        6.06       12.55
          2 |      6,617       13.59       26.14
          3 |      9,919       20.37       46.51
          4 |     12,611       25.90       72.40
          5 |      5,242       10.76       83.17
          6 |      6,991       14.36       97.52
          7 |      1,172        2.41       99.93
          8 |         34        0.07      100.00
------------+-----------------------------------
      Total |     48,700      100.00

. 
. //3. Verificación del factor de expansión
. sum fexp

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        fexp |     48,700    100.1061    148.4598   3.869264   1532.176

. 
. //4. Configuración del diseño de encuesta con fexp
. svyset _n [pweight=fexp]

Sampling weights: fexp
             VCE: linearized
     Single unit: missing
        Strata 1: <one>
 Sampling unit 1: <observations>
           FPC 1: <zero>

. 
. //5. Prueba ttest
. svy: mean conocimiento_ssr, over(discapacidad_nueva)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      1                                   Number of obs   =    48,700
Number of PSUs   = 48,700                                   Population size = 4,875,166
                                                            Design df       =    48,699

---------------------------------------------------------------------------------------
                                      |             Linearized
                                      |       Mean   std. err.     [95% conf. interval]
--------------------------------------+------------------------------------------------
c.conocimiento_ssr@discapacidad_nueva |
                                   0  |   3.479127   .0117489      3.456099    3.502155
                                   1  |   3.376284   .0316661      3.314218     3.43835
---------------------------------------------------------------------------------------

. svy: tab conocimiento_ssr discapacidad_nueva, col
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0493    .0493    .0493
        1 |   .0529    .0586    .0535
        2 |   .1363    .1301    .1356
        3 |   .2439    .2535     .245
        4 |   .3034    .3388    .3076
        5 |   .0944    .0889    .0938
        6 |    .103    .0688     .099
        7 |   .0164    .0115    .0158
        8 | 4.3e-04  5.4e-04  4.5e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   96.2032
    Design-based  F(7.33,  3.6e+05)=    4.6858    P = 0.0000

. 
. //6. Análisis comparativos con pesos
. //6.1 Distribución del conocimiento en SSR según discapacidad
. svy: tab conocimiento_ssr discapacidad_nueva, col
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0493    .0493    .0493
        1 |   .0529    .0586    .0535
        2 |   .1363    .1301    .1356
        3 |   .2439    .2535     .245
        4 |   .3034    .3388    .3076
        5 |   .0944    .0889    .0938
        6 |    .103    .0688     .099
        7 |   .0164    .0115    .0158
        8 | 4.3e-04  5.4e-04  4.5e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   96.2032
    Design-based  F(7.33,  3.6e+05)=    4.6858    P = 0.0000

. 
. //6.2 Comparación por zona rural/urbana
. svy: tab conocimiento_ssr area, col // Diferencias de conocimiento entre zona rural y urbana
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

-------------------------------------
conocimie |           Área           
nto_ssr   |  urbano    rural    Total
----------+--------------------------
        0 |    .028    .1006    .0493
        1 |   .0379    .0913    .0535
        2 |    .117    .1805    .1356
        3 |    .256    .2184     .245
        4 |   .3441    .2194    .3076
        5 |   .0965    .0872    .0938
        6 |    .106    .0822     .099
        7 |   .0142    .0197    .0158
        8 | 3.4e-04  7.0e-04  4.5e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         = 2569.9029
    Design-based  F(7.60,  3.7e+05)=  138.9527    P = 0.0000

. svy: tab discapacidad_nueva area, col // Proporción de mujeres con discapacidad según la zona rural y urbana
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

----------------------------------
discapaci |          Área         
dad_nueva | urbano   rural   Total
----------+-----------------------
        0 |  .8782   .8935   .8827
        1 |  .1218   .1065   .1173
          | 
    Total |      1       1       1
----------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(1)         =   22.7836
    Design-based  F(1, 48699)     =    8.5550     P = 0.0034

. 
. //6.3 Comparación por discapacidad en cada área
. svy: tab conocimiento_ssr discapacidad_nueva if area == 1, col // Mujeres en zona urbana
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    30,050
Number of PSUs   = 30,050                          Population size = 3,448,380
                                                   Design df       =    30,049

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0273    .0337     .028
        1 |   .0375    .0411    .0379
        2 |   .1176    .1124     .117
        3 |   .2553    .2609     .256
        4 |   .3409    .3675    .3441
        5 |   .0966    .0956    .0965
        6 |   .1101    .0762     .106
        7 |   .0145     .012    .0142
        8 | 3.0e-04  6.2e-04  3.4e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   50.7020
    Design-based  F(7.32,  2.2e+05)=    2.4953    P = 0.0131

. svy: tab conocimiento_ssr discapacidad_nueva if area == 2, col // Mujeres en zona rural
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    18,650
Number of PSUs   = 18,650                          Population size = 1,426,786
                                                   Design df       =    18,649

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .1016    .0925    .1006
        1 |   .0894    .1071    .0913
        2 |   .1806     .179    .1805
        3 |   .2167    .2332    .2184
        4 |   .2146    .2595    .2194
        5 |   .0893    .0703    .0872
        6 |   .0863    .0482    .0822
        7 |   .0208    .0099    .0197
        8 | 7.5e-04  3.1e-04  7.0e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   76.0551
    Design-based  F(6.98,  1.3e+05)=    4.2439    P = 0.0001

. 
. //6.4 Comparación por discapacidad
. svy: tab conocimiento_ssr discapacidad_nueva, col
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0493    .0493    .0493
        1 |   .0529    .0586    .0535
        2 |   .1363    .1301    .1356
        3 |   .2439    .2535     .245
        4 |   .3034    .3388    .3076
        5 |   .0944    .0889    .0938
        6 |    .103    .0688     .099
        7 |   .0164    .0115    .0158
        8 | 4.3e-04  5.4e-04  4.5e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   96.2032
    Design-based  F(7.33,  3.6e+05)=    4.6858    P = 0.0000

. 
. //6.5 Análisis por ubicación geográfica
. svy: tab conocimiento_ssr prov, col //Distribución del conocimiento por cada provincia
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

-----------------------------------------------------------------------------------------------------------------------------------
conocimie |                                                        Provincia                                                       
nto_ssr   |      01      02      03      04      05      06      07      08      09      10      11      12      13      14      15
----------+------------------------------------------------------------------------------------------------------------------------
        0 |   .0445   .1344   .0698   .0653   .1202   .1465   .0307   .0404   .0312   .0762   .0757   .0476   .0487    .113   .1281
        1 |   .0779    .081   .0955   .0889   .1243   .0957   .0507   .0598   .0273   .0876   .0742   .0489   .0692   .0895   .0874
        2 |   .1673    .186   .1652   .2027   .2091   .2086   .1142   .1273   .0978   .2012   .1631   .1151   .1371   .1665   .1788
        3 |   .2693   .2208   .2489   .2431   .2158   .2222   .2183   .2239   .2482   .2107     .26   .2326   .2683    .207   .1989
        4 |   .2605   .2123   .2518   .2231    .188   .1762   .3216   .3066   .3662   .2363   .2296   .3193   .2883   .2131    .221
        5 |   .0907   .0755   .0804   .0844   .0655   .0725   .1198   .0916    .101   .0796   .0954   .1023   .0802     .09   .0859
        6 |   .0802   .0746   .0722   .0785   .0678   .0665   .1209    .125   .1119   .0875   .0866   .1083   .0943   .1061   .0819
        7 |   .0095    .015   .0162   .0126   .0093   .0117   .0232   .0241    .016    .021   .0155   .0244   .0135   .0138   .0178
        8 |       0 3.1e-04       0   .0014       0       0 5.8e-04   .0014 3.9e-04       0       0   .0015 3.9e-04 1.0e-03 2.3e-04
          | 
    Total |       1       1       1       1       1       1       1       1       1       1       1       1       1       1       1
-----------------------------------------------------------------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------
conocimie |                                        Provincia                                       
nto_ssr   |      16      17      18      19      20      21      22      23      24      90   Total
----------+----------------------------------------------------------------------------------------
        0 |   .1322   .0189   .0892   .0639   .0328   .0587   .1626   .0335   .0436   .0668   .0493
        1 |   .0776   .0317   .0758   .0907   .0295   .0638   .0948   .0471   .0479   .0703   .0535
        2 |   .1677   .1355   .1497   .1691   .0956   .1605    .166   .1314   .1089   .1878   .1356
        3 |    .205   .2664   .2177   .2202   .2053   .2086   .1998   .2611   .2132   .1768    .245
        4 |    .218   .3484   .2659   .2233   .4117   .2932   .1981   .3072   .3183   .2884   .3076
        5 |   .0903   .0965   .0918   .1014   .0968   .1077   .0841   .0854   .1017   .0925   .0938
        6 |   .0937   .0907   .0889   .1086   .1194   .0875   .0815   .1195    .138   .1016    .099
        7 |   .0155   .0115   .0203   .0227   .0077   .0193   .0123   .0145   .0281   .0158   .0158
        8 |       0 4.1e-04 7.0e-04       0   .0012 6.4e-04 6.8e-04 2.7e-04 3.2e-04       0 4.5e-04
          | 
    Total |       1       1       1       1       1       1       1       1       1       1       1
---------------------------------------------------------------------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(192)       = 3000.2903
    Design-based  F(78.88,  3.8e+06)=   14.3613   P = 0.0000

. svy: tab discapacidad_nueva prov, col // Comparación de discapacidad por provincia
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

-----------------------------------------------------------------------------------------------------------------------------------
discapaci |                                                        Provincia                                                       
dad_nueva |    01    02    03    04    05    06    07    08    09    10    11    12    13    14    15    16    17    18    19    20
----------+------------------------------------------------------------------------------------------------------------------------
        0 | .8942 .9171 .8204 .8043 .8525 .9037 .9054 .8873 .9156 .8743 .8884 .8961 .7969 .9069 .9347 .9169 .8633 .8654 .9252 .8935
        1 | .1058 .0829 .1796 .1957 .1475 .0963 .0946 .1127 .0844 .1257 .1116 .1039 .2031 .0931 .0653 .0831 .1367 .1346 .0748 .1065
          | 
    Total |     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
-----------------------------------------------------------------------------------------------------------------------------------

-----------------------------------------------
discapaci |              Provincia             
dad_nueva |    21    22    23    24    90 Total
----------+------------------------------------
        0 | .9072 .9193 .8996 .9066 .9555 .8827
        1 | .0928 .0807 .1004 .0934 .0445 .1173
          | 
    Total |     1     1     1     1     1     1
-----------------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(24)        =  631.6512
    Design-based  F(10.21,  5.0e+05)=   21.3365   P = 0.0000

. levelsof prov_num, local(provincias)
variable prov_num not found
r(111);

end of do-file

r(111);

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. lookfor prov

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------------
prov            str2    %2s                   Provincia
f1_s4_10_1      byte    %8.0g                 10.1 ¿Cuánto tiempo le tomó (…) llegar al….. (establecimiento o proveedor de se
f1_s4_12_1      byte    %8.0g                 12.1 Una vez que (…) llegó al (establecimiento o proveedor de servicios de salu
f1_s4_13        byte    %8.0g      f1_s4_13   13.  Cuando (…) llegó al (establecimiento o proveedor de salud ) ¿quién le atend
f1_s4_16        byte    %8.0g      f1_s4_16   16.  ¿Por el o los gasto(s) que tuvo (…) en el establecimiento o proveedor de s
f1_s4_16_2      long    %12.0g                16.2 Persona-¿Por el o los gasto(s) que tuvo (…) en el establecimiento o prove
f1_s4_17        byte    %8.0g      f1_s4_17   17.  (...)¿compró medicamentos fuera del establecimiento o proveedor de salud en
f1_s4_43        byte    %8.0g      f1_s4_43   43.  ¿Cuál fue el motivo por el que (…) eligió ir a ese (establecimiento o prove
f1_s4_44_1      byte    %8.0g                 44.1 Cuánto tiempo le tomó (…) llegar al….. (establecimiento o proveedor de ser
f1_s4_46_1      int     %8.0g                 46.1 Una vez que (…) llegó al …(establecimiento o proveedor de servicios de sal
f1_s5_7_1       byte    %8.0g                 7.1 ¿Cuánto tiempo le tomó (….) llegar al …….(establecimiento o proveedor de se
f1_s5_9_1       byte    %8.0g                 9.1 Una vez que (…..) llegó al ....(establecimiento o proveedor de servicios de
f1_s5_18_1      byte    %8.0g                 18.1 ¿Cuánto tiempo le tomó (...) llegar al (establecimiento o proveedor de ser
f1_s5_20_1      byte    %8.0g                 20.1 Una vez que (…) llegó al …(establecimiento o proveedor de servicios de sal
f1_s5_29_1      byte    %8.0g                 29.1 ¿Cuánto tiempo le tomó (...) llegar al (establecimiento o proveedor de ser
f1_s5_31_1      byte    %8.0g                 31.1 Una vez que (…) llegó al …(establecimiento o proveedor de servicios de sal
f2_s10_1012_1   byte    %8.0g      f2_s10_1012_1
                                              1012.a ¿Si usted supiera:  Que un vendedor/proveedor/tendero de vegetales fres

. 
end of do-file

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. levelsof prov, local(provincias)
`"01"' `"02"' `"03"' `"04"' `"05"' `"06"' `"07"' `"08"' `"09"' `"10"' `"11"' `"12"' `"13"' `"14"' `"15"' `"16"' `"17"' `"18"' `"19"'
>  `"20"' `"21"' `"22"' `"23"' `"24"' `"90"'

. foreach p of local provincias {
  2.     di "Provincia `p'"
  3.     svy: tab conocimiento_ssr discapacidad_nueva if prov_num == `p', col
  4. } // Conocimiento en cada provincia en mujeres con y sin discapacidad
Provincia 01
prov_num not found
r(111);

end of do-file

r(111);

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. levelsof prov, local(provincias)
`"01"' `"02"' `"03"' `"04"' `"05"' `"06"' `"07"' `"08"' `"09"' `"10"' `"11"' `"12"' `"13"' `"14"' `"15"' `"16"' `"17"' `"18"' `"19"'
>  `"20"' `"21"' `"22"' `"23"' `"24"' `"90"'

. foreach p of local provincias {
  2.     di "Provincia `p'"
  3.     svy: tab conocimiento_ssr discapacidad_nueva if prov == `p', col
  4. } // Conocimiento en cada provincia en mujeres con y sin discapacidad
Provincia 01
type mismatch
r(109);

end of do-file

r(109);

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. levelsof prov, local(provincias)
`"01"' `"02"' `"03"' `"04"' `"05"' `"06"' `"07"' `"08"' `"09"' `"10"' `"11"' `"12"' `"13"' `"14"' `"15"' `"16"' `"17"' `"18"' `"19"'
>  `"20"' `"21"' `"22"' `"23"' `"24"' `"90"'

. foreach p of local provincias {
  2.     di "Provincia `p'"
  3.     svy: tab conocimiento_ssr discapacidad_nueva if prov == `p', col
  4. } // Conocimiento en cada provincia en mujeres con y sin discapacidad
Provincia 01
type mismatch
r(109);

end of do-file

r(109);

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. levelsof prov, local(provincias)
`"01"' `"02"' `"03"' `"04"' `"05"' `"06"' `"07"' `"08"' `"09"' `"10"' `"11"' `"12"' `"13"' `"14"' `"15"' `"16"' `"17"' `"18"' `"19"'
>  `"20"' `"21"' `"22"' `"23"' `"24"' `"90"'

. foreach p of local provincias {
  2.     di "Provincia `p'"
  3.     svy: tab conocimiento_ssr discapacidad_nueva if prov == `p', col
  4. } // Conocimiento en cada provincia en mujeres con y sin discapacidad
Provincia 01
type mismatch
r(109);

end of do-file

r(109);

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. levelsof prov, local(provincias)
`"01"' `"02"' `"03"' `"04"' `"05"' `"06"' `"07"' `"08"' `"09"' `"10"' `"11"' `"12"' `"13"' `"14"' `"15"' `"16"' `"17"' `"18"' `"19"'
>  `"20"' `"21"' `"22"' `"23"' `"24"' `"90"'

. foreach p of local provincias {
  2.     di "Provincia `p'"
  3.     svy: tab conocimiento_ssr discapacidad_nueva if prov == `p', col
  4. } // Conocimiento en cada provincia en mujeres con y sin discapacidad
Provincia 01
type mismatch
r(109);

end of do-file

r(109);

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. levelsof prov, local(provincias)
`"01"' `"02"' `"03"' `"04"' `"05"' `"06"' `"07"' `"08"' `"09"' `"10"' `"11"' `"12"' `"13"' `"14"' `"15"' `"16"' `"17"' `"18"' `"19"'
>  `"20"' `"21"' `"22"' `"23"' `"24"' `"90"'

. foreach p of local provincias {
  2.     di "Provincia `p'"
  3.     svy: tab conocimiento_ssr discapacidad_nueva if prov == "`p'", col
  4. } // Conocimiento en cada provincia en mujeres con y sin discapacidad
Provincia 01
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,404
Number of PSUs   = 1,404                          Population size = 257,455.83
                                                  Design df       =      1,403

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 |  .044  .0494  .0445
        1 | .0722   .126  .0779
        2 | .1547   .274  .1673
        3 | .2771   .204  .2693
        4 | .2646  .2264  .2605
        5 | .0953  .0512  .0907
        6 | .0815   .069  .0802
        7 | .0106      0  .0095
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =   24.3944
    Design-based  F(6.72, 9432.86)=    2.4581     P = 0.0177
Provincia 02
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,446
Number of PSUs   = 1,446                          Population size = 55,358.475
                                                  Design df       =      1,445

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .1369    .1064    .1344
        1 |     .08    .0927     .081
        2 |   .1856     .191     .186
        3 |   .2262    .1606    .2208
        4 |    .203    .3148    .2123
        5 |   .0783     .045    .0755
        6 |   .0762    .0578    .0746
        7 |   .0139     .028     .015
        8 |       0    .0037  3.1e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   18.0928
    Design-based  F(7.10, 10266.44)=    1.9098    P = 0.0627
Provincia 03
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,344
Number of PSUs   = 1,344                          Population size = 79,499.698
                                                  Design df       =      1,343

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0744  .0488  .0698
        1 | .0906  .1179  .0955
        2 | .1593  .1921  .1652
        3 | .2498  .2444  .2489
        4 | .2525  .2487  .2518
        5 | .0839  .0642  .0804
        6 |  .074  .0644  .0722
        7 | .0155  .0195  .0162
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =    6.1260
    Design-based  F(6.59, 8854.08)=    0.7198     P = 0.6468
Provincia 04
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,435
Number of PSUs   = 1,435                          Population size = 52,625.483
                                                  Design df       =      1,434

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |    .067    .0584    .0653
        1 |   .0838      .11    .0889
        2 |   .2019     .206    .2027
        3 |   .2466    .2286    .2431
        4 |   .2086    .2828    .2231
        5 |   .0911    .0571    .0844
        6 |   .0867    .0445    .0785
        7 |   .0137     .008    .0126
        8 | 6.1e-04    .0046    .0014
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   19.2856
    Design-based  F(6.79, 9737.41)=    2.0301     P = 0.0497
Provincia 05
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,902
Number of PSUs   = 1,902                          Population size = 135,132.54
                                                  Design df       =      1,901

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .1192  .1254  .1202
        1 | .1219  .1387  .1243
        2 | .2086  .2115  .2091
        3 | .2161  .2139  .2158
        4 |  .186  .1997   .188
        5 | .0661   .062  .0655
        6 | .0715  .0465  .0678
        7 | .0105  .0023  .0093
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =    4.8729
    Design-based  F(6.66, 12656.07)=    0.6609    P = 0.6976
Provincia 06
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,949
Number of PSUs   = 1,949                          Population size = 145,502.62
                                                  Design df       =      1,948

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .1506   .108  .1465
        1 | .1001  .0549  .0957
        2 | .2086  .2086  .2086
        3 | .2215  .2286  .2222
        4 | .1684  .2499  .1762
        5 | .0716  .0816  .0725
        6 | .0669   .063  .0665
        7 | .0124  .0054  .0117
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =   13.1215
    Design-based  F(6.64, 12939.53)=    1.7757    P = 0.0916
Provincia 07
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      3,401
Number of PSUs   = 3,401                          Population size = 195,449.32
                                                  Design df       =      3,400

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0302     .035    .0307
        1 |   .0521    .0367    .0507
        2 |   .1117    .1384    .1142
        3 |   .2177    .2238    .2183
        4 |   .3171    .3649    .3216
        5 |   .1215    .1033    .1198
        6 |   .1248    .0836    .1209
        7 |   .0242    .0143    .0232
        8 | 6.4e-04        0  5.8e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   11.8494
    Design-based  F(7.55, 25661.44)=    1.2068    P = 0.2923
Provincia 08
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      2,152
Number of PSUs   = 2,152                          Population size = 173,994.67
                                                  Design df       =      2,151

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 |  .042  .0281  .0404
        1 | .0584  .0702  .0598
        2 | .1315  .0947  .1273
        3 | .2176  .2734  .2239
        4 | .3016  .3461  .3066
        5 |   .09  .1039  .0916
        6 |  .132  .0698   .125
        7 | .0254  .0138  .0241
        8 | .0015      0  .0014
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   16.8694
    Design-based  F(7.21, 15504.01)=    1.7540    P = 0.0895
Provincia 09
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =     3,980
Number of PSUs   = 3,980                           Population size = 1,235,435
                                                   Design df       =     3,979

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0303    .0405    .0312
        1 |    .028    .0203    .0273
        2 |   .1001    .0723    .0978
        3 |   .2515     .213    .2482
        4 |   .3569    .4674    .3662
        5 |   .1008    .1031     .101
        6 |   .1153    .0748    .1119
        7 |   .0167    .0086     .016
        8 | 4.3e-04        0  3.9e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   22.1851
    Design-based  F(7.62, 30316.93)=    2.6055    P = 0.0087
Provincia 10
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =     1,461
Number of PSUs   = 1,461                           Population size = 133,258.4
                                                   Design df       =     1,460

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0738  .0932  .0762
        1 | .0849  .1062  .0876
        2 | .2028  .1902  .2012
        3 | .2125  .1975  .2107
        4 | .2391  .2167  .2363
        5 | .0769  .0982  .0796
        6 | .0869  .0918  .0875
        7 | .0231  .0062   .021
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =    5.4208
    Design-based  F(6.55, 9568.87)=    0.6291     P = 0.7216
Provincia 11
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,548
Number of PSUs   = 1,548                          Population size = 141,053.55
                                                  Design df       =      1,547

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0723  .1029  .0757
        1 | .0705  .1033  .0742
        2 |  .168  .1245  .1631
        3 | .2568  .2854    .26
        4 | .2282  .2403  .2296
        5 | .0961  .0893  .0954
        6 | .0911  .0512  .0866
        7 |  .017  .0031  .0155
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =   11.2894
    Design-based  F(6.38, 9875.57)=    1.1668     P = 0.3199
Provincia 12
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      3,004
Number of PSUs   = 3,004                          Population size = 261,528.36
                                                  Design df       =      3,003

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0512  .0162  .0476
        1 |   .05  .0395  .0489
        2 | .1137  .1276  .1151
        3 | .2312  .2447  .2326
        4 | .3135  .3692  .3193
        5 | .0986  .1346  .1023
        6 | .1145  .0552  .1083
        7 | .0259  .0115  .0244
        8 | .0015  .0014  .0015
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   26.2351
    Design-based  F(7.11, 21355.38)=    2.5766    P = 0.0114
Provincia 13
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      2,789
Number of PSUs   = 2,789                          Population size = 444,679.86
                                                  Design df       =      2,788

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0517     .037    .0487
        1 |    .066    .0815    .0692
        2 |   .1418    .1189    .1371
        3 |   .2587    .3057    .2683
        4 |   .2776    .3302    .2883
        5 |   .0828    .0703    .0802
        6 |   .1059     .049    .0943
        7 |   .0155    .0055    .0135
        8 |       0    .0019  3.9e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   37.3016
    Design-based  F(7.29, 20314.21)=    3.7169    P = 0.0004
Provincia 14
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,480
Number of PSUs   = 1,480                          Population size = 50,573.654
                                                  Design df       =      1,479

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |    .113    .1128     .113
        1 |   .0891    .0929    .0895
        2 |   .1702    .1306    .1665
        3 |   .2051    .2257     .207
        4 |   .2058    .2839    .2131
        5 |   .0915    .0754      .09
        6 |   .1089    .0788    .1061
        7 |   .0153        0    .0138
        8 |   .0011        0  1.0e-03
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =    8.7212
    Design-based  F(7.68, 11352.97)=    0.9848    P = 0.4439
Provincia 15
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      2,459
Number of PSUs   = 2,459                          Population size = 36,639.757
                                                  Design df       =      2,458

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .1242    .1839    .1281
        1 |   .0878    .0814    .0874
        2 |   .1788    .1801    .1788
        3 |   .1998    .1859    .1989
        4 |   .2182    .2618     .221
        5 |   .0882    .0533    .0859
        6 |   .0846    .0433    .0819
        7 |   .0183    .0103    .0178
        8 | 2.4e-04        0  2.3e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   11.4970
    Design-based  F(7.51, 18450.20)=    1.3324    P = 0.2259
Provincia 16
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,909
Number of PSUs   = 1,909                          Population size = 31,730.545
                                                  Design df       =      1,908

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 |  .126  .2007  .1322
        1 | .0762   .093  .0776
        2 | .1724  .1154  .1677
        3 | .2073  .1793   .205
        4 | .2173  .2261   .218
        5 | .0897  .0973  .0903
        6 | .0964  .0635  .0937
        7 | .0147  .0247  .0155
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =   12.8354
    Design-based  F(6.81, 12990.97)=    1.6670    P = 0.1144
Provincia 17
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,742
Number of PSUs   = 1,742                          Population size = 888,291.71
                                                  Design df       =      1,741

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0171    .0302    .0189
        1 |    .033    .0238    .0317
        2 |   .1391    .1128    .1355
        3 |    .262    .2942    .2664
        4 |   .3498    .3398    .3484
        5 |   .0968    .0944    .0965
        6 |   .0913    .0866    .0907
        7 |   .0104    .0183    .0115
        8 | 4.8e-04        0  4.1e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =    5.6299
    Design-based  F(7.04, 12252.88)=    0.5586    P = 0.7909
Provincia 18
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,310
Number of PSUs   = 1,310                          Population size = 159,043.39
                                                  Design df       =      1,309

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0916    .0734    .0892
        1 |   .0793    .0533    .0758
        2 |   .1478    .1614    .1497
        3 |   .2084    .2776    .2177
        4 |   .2647    .2737    .2659
        5 |   .0952    .0695    .0918
        6 |   .0928    .0643    .0889
        7 |   .0193    .0267    .0203
        8 | 8.1e-04        0  7.0e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =    8.5636
    Design-based  F(7.61, 9960.44)=    0.7078     P = 0.6776
Provincia 19
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,565
Number of PSUs   = 1,565                          Population size = 30,904.137
                                                  Design df       =      1,564

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0633  .0714  .0639
        1 | .0928  .0652  .0907
        2 |  .171  .1454  .1691
        3 | .2232  .1827  .2202
        4 | .2127  .3541  .2233
        5 | .1029  .0821  .1014
        6 | .1093  .0991  .1086
        7 | .0246      0  .0227
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =   15.3907
    Design-based  F(6.55, 10239.79)=    1.6888    P = 0.1122
Provincia 20
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,617
Number of PSUs   = 1,617                          Population size = 9,318.1227
                                                  Design df       =      1,616

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0346  .0175  .0328
        1 | .0303  .0231  .0295
        2 |  .098  .0754  .0956
        3 | .2062  .1976  .2053
        4 | .4039  .4766  .4117
        5 | .0939  .1219  .0968
        6 | .1231  .0879  .1194
        7 | .0086      0  .0077
        8 | .0014      0  .0012
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =    9.0508
    Design-based  F(8.00, 12923.83)=    1.1323    P = 0.3375
Provincia 21
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,870
Number of PSUs   = 1,870                          Population size = 63,104.687
                                                  Design df       =      1,869

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |    .059    .0555    .0587
        1 |   .0658    .0434    .0638
        2 |   .1644    .1221    .1605
        3 |    .209    .2054    .2086
        4 |   .2885    .3399    .2932
        5 |   .1041    .1435    .1077
        6 |   .0908    .0551    .0875
        7 |   .0182    .0302    .0193
        8 | 1.9e-04     .005  6.4e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   15.9253
    Design-based  F(7.23, 13505.53)=    1.6300    P = 0.1192
Provincia 22
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,834
Number of PSUs   = 1,834                          Population size = 42,001.304
                                                  Design df       =      1,833

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |    .168    .1006    .1626
        1 |   .0941    .1034    .0948
        2 |   .1664    .1613     .166
        3 |   .2011     .185    .1998
        4 |   .1907    .2821    .1981
        5 |   .0852    .0722    .0841
        6 |   .0818    .0784    .0815
        7 |   .0119    .0171    .0123
        8 | 7.4e-04        0  6.8e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   10.5669
    Design-based  F(7.33, 13435.70)=    1.1696    P = 0.3154
Provincia 23
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =     3,086
Number of PSUs   = 3,086                           Population size = 131,780.5
                                                   Design df       =     3,085

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0336    .0328    .0335
        1 |   .0452    .0644    .0471
        2 |   .1304    .1399    .1314
        3 |   .2604    .2669    .2611
        4 |   .3073    .3071    .3072
        5 |   .0824    .1116    .0854
        6 |   .1251    .0696    .1195
        7 |   .0153    .0076    .0145
        8 | 3.0e-04        0  2.7e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   13.6193
    Design-based  F(6.81, 21011.77)=    1.3694    P = 0.2151
Provincia 24
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      1,769
Number of PSUs   = 1,769                          Population size = 109,671.21
                                                  Design df       =      1,768

-------------------------------------
conocimie |    discapacidad_nueva    
nto_ssr   |       0        1    Total
----------+--------------------------
        0 |   .0421    .0588    .0436
        1 |   .0458    .0684    .0479
        2 |   .1131    .0684    .1089
        3 |   .2169    .1772    .2132
        4 |   .3058    .4396    .3183
        5 |   .1022    .0963    .1017
        6 |   .1458    .0621     .138
        7 |    .028    .0292    .0281
        8 | 3.6e-04        0  3.2e-04
          | 
    Total |       1        1        1
-------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(8)         =   22.5834
    Design-based  F(7.46, 13191.52)=    2.6302    P = 0.0086
Provincia 90
(running tabulate on estimation sample)

Number of strata =   1                            Number of obs   =        244
Number of PSUs   = 244                            Population size = 11,133.199
                                                  Design df       =        243

-------------------------------
conocimie | discapacidad_nueva 
nto_ssr   |     0      1  Total
----------+--------------------
        0 | .0671  .0603  .0668
        1 | .0668  .1455  .0703
        2 | .1966      0  .1878
        3 | .1714  .2924  .1768
        4 | .2866  .3265  .2884
        5 | .0943  .0548  .0925
        6 | .1035  .0603  .1016
        7 | .0137  .0603  .0158
          | 
    Total |     1      1      1
-------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(7)         =    5.7638
    Design-based  F(6.03, 1464.42)=    0.8251     P = 0.5509

. 
end of do-file

. do "C:\Users\LENOVO\AppData\Local\Temp\STD5f74_000000.tmp"

. // 7. Definición de la variable edad por categorías
. gen edad_cat = .
(48,700 missing values generated)

. replace edad_cat = 1 if f1_s2_3_1 < 16
(9,126 real changes made)

. replace edad_cat = 2 if f1_s2_3_1 >= 16 & f1_s2_3_1 <= 24
(13,013 real changes made)

. replace edad_cat = 3 if f1_s2_3_1 >= 25 & f1_s2_3_1 <= 49
(26,561 real changes made)

. replace edad_cat = 4 if f1_s2_3_1 >= 50
(0 real changes made)

. label define edad_labels 1 "Menores de 16" 2 "16-24" 3 "25-49" 4 "50 o más"

. label values edad_cat edad_labels

. 
. //6.6 Análisis de conocimiento según la edad
. svy: tab conocimiento_ssr edad_cat, col // Conocimiento por edad
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699

----------------------------------------------
conocimie |              edad_cat             
nto_ssr   | Menores    16-24    25-49    Total
----------+-----------------------------------
        0 |   .1591    .0171     .028    .0493
        1 |   .1511    .0254    .0344    .0535
        2 |   .3079    .1396    .0767    .1356
        3 |   .3341    .3933    .1464     .245
        4 |   .0414    .1848    .4528    .3076
        5 |   .0037    .0899    .1253    .0938
        6 |   .0021    .1272    .1179     .099
        7 | 4.8e-04    .0218    .0181    .0158
        8 |       0  9.0e-04  3.8e-04  4.5e-04
          | 
    Total |       1        1        1        1
----------------------------------------------
Key: Column proportion

  Pearson:
    Uncorrected   chi2(16)        =  1.67e+04
    Design-based  F(14.34,  7.0e+05)=  434.9270   P = 0.0000

. svy: tab conocimiento_ssr if discapacidad_nueva == 0, col // Conocimiento SSR en mujeres SIN discapacidad
(running tabulate on estimation sample)

Number of strata =      1                          Number of obs   =    43,542
Number of PSUs   = 43,542                          Population size = 4,303,338
                                                   Design df       =    43,541

----------------------
conocimie |
nto_ssr   |     column
----------+-----------
        0 |      .0493
        1 |      .0529
        2 |      .1363
        3 |      .2439
        4 |      .3034
        5 |      .0944
        6 |       .103
        7 |      .0164
        8 |    4.3e-04
          | 
    Total |          1
----------------------
Key:   column = Column proportion

. svy: tab conocimiento_ssr if discapacidad_nueva == 1, col // Conocimiento SSR en mujeres CON discapacidad
(running tabulate on estimation sample)

Number of strata =     1                          Number of obs   =      5,158
Number of PSUs   = 5,158                          Population size = 571,827.06
                                                  Design df       =      5,157

----------------------
conocimie |
nto_ssr   |     column
----------+-----------
        0 |      .0493
        1 |      .0586
        2 |      .1301
        3 |      .2535
        4 |      .3388
        5 |      .0889
        6 |      .0688
        7 |      .0115
        8 |    5.4e-04
          | 
    Total |          1
----------------------
Key:   column = Column proportion

. svy: mean conocimiento_ssr, over(discapacidad_nueva) // Media para comprobar
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      1                                   Number of obs   =    48,700
Number of PSUs   = 48,700                                   Population size = 4,875,166
                                                            Design df       =    48,699

---------------------------------------------------------------------------------------
                                      |             Linearized
                                      |       Mean   std. err.     [95% conf. interval]
--------------------------------------+------------------------------------------------
c.conocimiento_ssr@discapacidad_nueva |
                                   0  |   3.479127   .0117489      3.456099    3.502155
                                   1  |   3.376284   .0316661      3.314218     3.43835
---------------------------------------------------------------------------------------

. svy: regress conocimiento_ssr discapacidad_nueva // Significancia estadística
(running regress on estimation sample)

Survey: Linear regression

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699
                                                   F(1, 48699)     =      9.27
                                                   Prob > F        =    0.0023
                                                   R-squared       =    0.0005

------------------------------------------------------------------------------------
                   |             Linearized
  conocimiento_ssr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
discapacidad_nueva |  -.1028432   .0337754    -3.04   0.002    -.1690434    -.036643
             _cons |   3.479127   .0117489   296.12   0.000     3.456099    3.502155
------------------------------------------------------------------------------------

. 
. // 8. Análisis de la discapacidad y conocimiento por variables
. svy: regress conocimiento_ssr discapacidad_nueva edad_cat area nivins
(running regress on estimation sample)

Survey: Linear regression

Number of strata =      1                          Number of obs   =    48,700
Number of PSUs   = 48,700                          Population size = 4,875,166
                                                   Design df       =    48,699
                                                   F(4, 48696)     =   1684.27
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.2315

------------------------------------------------------------------------------------
                   |             Linearized
  conocimiento_ssr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
discapacidad_nueva |  -.2812967   .0303188    -9.28   0.000    -.3407219   -.2218715
          edad_cat |   .7549119   .0128606    58.70   0.000     .7297049    .7801188
              area |  -.3539536   .0224283   -15.78   0.000    -.3979133   -.3099938
            nivins |    .328684   .0133118    24.69   0.000     .3025928    .3547752
             _cons |   1.263551   .0534984    23.62   0.000     1.158694    1.368409
------------------------------------------------------------------------------------

. graph bar (mean) conocimiento_ssr, over(prov) ///
>     bar(1, color(blue)) ytitle("Mean SRH Knowledge") ///
>     title("SRH Knowledge by Province")

. // Cerrar log
. log close
      name:  <unnamed>
       log:  C:\Users\LENOVO\Documents\YOUNG RESEARCHERS FELLOWSHIP\PAPER YRF\log_resultados.log
  log type:  text
 closed on:  30 Mar 2025, 16:35:11
------------------------------------------------------------------------------------------------------------------------------------
